carfactory/app/views/cars/_form.html.erb

SELECT "parts".* FROM "parts"
---
    <%= form.label :part %>
    <%= form.collection_select :part, Part.all, :id, :name, prompt: true %>